Revit 2024 API
ParameterTypeId.PathOfTravelFromRoom Property
 "From Room"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId PathOfTravelFromRoom { get; }
Visual Basic
Public Shared ReadOnly Property PathOfTravelFromRoom As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ PathOfTravelFromRoom {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace